print('«Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .»')

a = input('Введите значение a: ')
b = input('Введите значение b: ')
c = input('Введите значение c: ')
d = input('Введите значение d: ')
g = input('Введите значение g: ')
h = input('Введите значение h: ')
i = input('Введите значение i: ')

print(f'«Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d} . Снизу шляпка затянута {g} плёнкой. Когда её уберёшь, откроется нижняя {h} сторона шляпк{i} .»')